# Taps
tap "homebrew/bundle"

# AI
cask "claude"
cask "chatgpt"
cask "chatgpt-atlas"
cask "google-gemini"
cask "cursor"

# Browsers
cask "brave-browser"
cask "google-chrome"

# Dev tools
cask "beyond-compare"
cask "db-browser-for-sqlite"
cask "fork"
cask "ghostty"
cask "github-copilot-for-xcode"
cask "http-toolkit"
cask "iterm2"
cask "warp"
cask "postman"
cask "proxyman"
cask "raycast"
cask "visual-studio-code"

# Communication
cask "discord"
cask "gather"
cask "notion"
cask "obsidian"
cask "slack"
cask "telegram"
cask "zoom"

# Utilities
cask "openkey"
cask "pritunl"
cask "scroll-reverser"

# CLI tools
brew "acli"
brew "fastlane"
brew "ffmpeg"
brew "gitlab-ci-local"
brew "gitlab-runner"
brew "node"
brew "opencode"
brew "python@3.14"
brew "ripgrep"
brew "rtk"
brew "ruby"
brew "swift-format"
brew "swiftformat"
brew "swiftlint"
brew "terminal-notifier"
brew "watchman"
brew "xcbeautify"
