# Taps
tap "homebrew/bundle"

# Apps
cask "cursor"
cask "db-browser-for-sqlite"
cask "ghostty"
cask "github-copilot-for-xcode"
cask "raycast"
cask "visual-studio-code"
cask "warp"

# CLI tools
brew "fastlane"
brew "ffmpeg"
brew "gitlab-ci-local"
brew "gitlab-runner"
brew "node"
brew "opencode"
brew "python@3.14"
brew "ripgrep"
brew "rtk"
brew "ruby"
brew "swift-format"
brew "swiftformat"
brew "swiftlint"
brew "terminal-notifier"
brew "watchman"
brew "xcbeautify"
brew "acli"
